// 에제1 배열 numbers = [20, 37, -21, 32, -2] 에서 document.write를 이용하여 37,32를 결과값으로 나오게 작성
// const numbers = [20, 37, -21, 32, -2];
// document.write(numbers[1]);
// document.write(numbers[3]);
// console.log(numbers[1]);
// console.log(numbers[3]);

// 예제2. scores = [67,82,97,100,92] 배열의 각 요소 값을 1) For문을 이용하여 출력 2) For of 문을 이용하여 출력
// const scores = [67, 82, 97, 100, 92];

// 예제3. tel["010","1234","5678"]을 문자열 010-1234-5678 로 변환하시오.

// 예제4. color = ["빨강","노랑","파랑","주황"] 메서드를 이용하여 노랑,파랑,주황/빨강의 실행 결과 내시오.

// 예제 5.
//  3명 학생 4과목 성적의 합계와 평균을 구하라.
// [83, 90, 70, 87], [87,93,62,83], [98,90,77,97]

// 예제 6.
// 배열을 이용하여 성적의 합계와 평균을 구하시오.
// mathScores = [90,85,70,86,97]

// 예제 7.
// tempNumbers = [7, -24, -8, 10, 17, -18]
// 0보다 작은 수 중에 가장 첫 번째 숫자를 결과로 나타내시오.

// 예제 9.
// a = [12, 0, 2, 5, 4]
// b = [0, 2, 3, 12, 8]
// 두 배열의 요소 값이 서로 같은 요소들로 새로운 배열을 생성하여 결과로 내시오

// 예제 10.
// numbers2 = [1,3,5];
// 위 배열을 이용하여 실행 결과 10,30,50를 내시오.
